---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionAccessor.HasResolutions
source: html/24d152b0-47a3-bc4d-54bd-a13504f85841.htm
---
# Autodesk.Revit.DB.FailureDefinitionAccessor.HasResolutions Method

Checks if the FailureDefinition has at least one resolution.

## Syntax (C#)
```csharp
public bool HasResolutions()
```

## Returns
True if at least one resolution is defined in the FailureDefinition.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The FailureDefinitionAccessor has not been properly initialized.